app/views/api/tags/get_all_taglines.json.jbuilder

    json.message "Box Title fetched successfully..."
    json.boxes @tags.collect{|tag| tag.tag_line}
---
SELECT `tags`.* FROM `tags` WHERE (close_date is not NULL AND close_date >= '2015-11-01')