app/views/api/ratings/_rating_details.json.jbuilder

SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 29 AND `user_ratings`.`rating_id` = 16 ORDER BY `user_ratings`.`id` DESC LIMIT 1
---
json.comments @drop.try(:comments)
json.is_like (UserRating.where(user_id: @user.try(:id), rating_id: @drop.id).try(:last).try(:is_like) || false)