app/controllers/api/notifications_controller.rb

  def all_notifications
    @user = User.find_by_authentication_token(params[:auth_token])
    @notifications = Notification.where("user_id = ? AND status is NULL AND is_view is NULL", @user.id).order("created_at desc").limit(30) if @user.present?
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE (user_id = 1 AND status is NULL AND is_view is NULL) ORDER BY created_at desc LIMIT 30

  def update
    @user = User.find_by_authentication_token params[:auth_token]
    @notification = Notification.find_by_id(params[:request][:id]) if @user.present?
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1