app/controllers/api/notifications_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 404 LIMIT 1
UPDATE `notifications` SET `is_seen` = 1, `updated_at` = '2016-01-16 16:01:40' WHERE `notifications`.`id` = 5
UPDATE `users` SET `last_sign_in_at` = '2016-01-17 08:25:12', `current_sign_in_at` = '2016-01-17 12:15:41', `sign_in_count` = 33, `updated_at` = '2016-01-17 12:15:41' WHERE `users`.`id` = 1
---
  def all_notifications
    user = User.find_by_authentication_token(params[:auth_token])
    if params[:date].present? && params[:auth_token].present?
      @reveal = Notification.where("updated_at <= ? AND user_id = ? AND status is NULL AND is_view is NULL", params[:date].to_datetime.to_s(:db), user.id).order("created_at desc").limit(30)
      #Reveal.where("updated_at <= ? AND user_id = ?", params[:date].to_datetime.to_s(:db), current_user).order("updated_at desc").limit(30)
      if @reveal.present?
        get_api_message "200","success"
        respond_to do |format|
          format.html { redirect_to @reveal, notice: 'Reveal found successfully' }
          format.json { render json: {:response => {:status=>@message.status,:code=>@message.code,:message=>@message.custom_message, :notifications => @reveal.collect { |t| t.attributes.keep_if { |k, v| !["user_id"].include?(k)  }.merge!( build_hash(t,user))}}  } }
        end
        @reveal.each do |reveal|
          reveal.update_attributes is_seen: true