app/controllers/api/ratings_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'hyYjZ6YS3Qhgq4CAz6qq' LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
INSERT INTO `ratings` (`audio`, `audio_duration`, `audio_file_url`, `comment`, `created_at`, `is_anonymous_rating`, `is_box_locked`, `is_flagged`, `is_post_to_wall`, `rating`, `rating_like_count`, `reveal_id`, `sub_rating`, `tag_id`, `updated_at`, `user_id`) VALUES (NULL, NULL, NULL, 'Dropping on locked box. Just for testing.', '2016-02-21 17:14:05', 0, 1, 0, 0, NULL, 0, NULL, NULL, 1, '2016-02-21 17:14:05', 1)
UPDATE `users` SET `last_sign_in_at` = '2016-02-20 16:41:37', `current_sign_in_at` = '2016-02-21 17:12:44', `sign_in_count` = 49, `updated_at` = '2016-02-21 17:12:44' WHERE `users`.`id` = 1
UPDATE `ratings` SET `created_at` = '2016-02-21 17:05:05', `updated_at` = '2016-02-21 17:14:05' WHERE `ratings`.`id` = 30
---
  def create
    current_user = User.find_by_authentication_token params[:auth_token]
    @rating = Rating.new params[:request][:rating].merge!({user_id: current_user.id})
    #tellum_host = request.host
    tag = Tag.find(params[:request][:rating][:tag_id])
    tag_creator_user_id = tag.try(:user)
    @user = current_user
    anonymous_rating = params[:request][:rating][:is_anonymous_rating]
    if @rating.save

      #@rating.update_attribute :created_at, @rating.created_at - (9.minutes + 55.seconds)
      #@rating.update_attribute :created_at, @rating.created_at - (9.minutes + 55.seconds)
      @rating.update_attribute :is_box_locked, params[:request][:rating][:is_box_locked]
      @rating.update_attribute :sort_date, @rating.updated_at
      # commented mail section
      # unless tag_creator_user_id.id == current_user.id
      #  SendMailToTagCreator.send_tag_creator(current_user, tag_creator_user_id.id, params[:request][:rating][:tag_id], anonymous_rating, tellum_host).deliver if tag_creator_user_id.email.present?
      # end
      badge_count = tag_creator_user_id.try(:badge_count) + 1
      tag_creator_user_id.update_attributes badge_count: badge_count
      if anonymous_rating == 1 || anonymous_rating == true
        if current_user.id != tag_creator_user_id.id
          @not=Notification.create(tag_id: tag.id, user_id: tag.user_id, rating_id: @rating.id, object_name: "Dropped", sender_id: current_user.id, is_anonymous_user: true)
          @not.update_attribute :is_anonymous_user, true

SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 200 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      end
      get_api_message "200", "Created"
      respond_to do |format|
        format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :rating => @rating.attributes.keep_if { |k, v| k.to_s != "tag_id" }.keep_if { |k, v| k.to_s != "user_id" }.merge!({tag_line: Tag.find(@rating.tag_id).attributes, user: User.find(@rating.user_id).hide_fields})}} }

SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'AXZsb3JYS56XuzKgsbux' LIMIT 1
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 29 AND `user_ratings`.`rating_id` = 16 ORDER BY `user_ratings`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find_by_authentication_token params[:auth_token]
    @drop = Rating.find_by_id(params[:rating_id]) if @user.present?

SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`rating_id` = 1 AND `user_ratings`.`user_id` = 1 ORDER BY `user_ratings`.`id` DESC LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`id` = 1 LIMIT 1
UPDATE `user_ratings` SET `is_like` = 0, `updated_at` = '2015-12-10 19:22:43' WHERE `user_ratings`.`id` = 1
UPDATE `users` SET `last_sign_in_at` = '2015-11-26 18:40:33', `current_sign_in_at` = '2015-12-10 19:22:04', `sign_in_count` = 23, `updated_at` = '2015-12-10 19:22:04' WHERE `users`.`id` = 1
---
  def like_rating
    if params[:request][:rating][:rating_id]
      current_user = User.find_by_authentication_token params[:auth_token]
      @user_rating = UserRating.where(rating_id: params[:request][:rating][:rating_id], user_id: current_user.id).last
      @rating = Rating.find params[:request][:rating][:rating_id]
      if @user_rating.present?
        @user_rating.update_attributes(is_like: params[:request][:rating][:is_like])