app/controllers/api/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'toB4Pj9dmFkYYTwB78AC' LIMIT 1
UPDATE `users` SET `authentication_token` = '8RsxLTXHxYnbGN3mvCVy', `updated_at` = '2016-02-08 19:16:27' WHERE `users`.`id` = 1
---
  def destroy
    if params[:auth_token].present?
      @user=User.find_by_authentication_token(params[:auth_token])
      if @user.present?
        @user.reset_authentication_token!
        @user.update_attribute :device_token, ""