app/controllers/api/tags_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 200 LIMIT 1
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 1 AND `user_ratings`.`rating_id` = 2 ORDER BY `user_ratings`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def search_tagline_any_where
    if params[:auth_token].nil? && params[:tag_line].nil?
      get_api_message "501","Invalid Request"
      respond_to do |format|
        format.html { redirect_to @tag, notice: 'Invalid request.' }
        format.json { render json: {:response => {:status=>@message.status,:code=>@message.code,:message=>@message.custom_message, :search_term => params[:search_term], :auth_token => params[:auth_token] } } }
      end
    else
      current_user = User.find_by_authentication_token(params[:auth_token])
      @tag = Tag.where("tag_line like :query OR tag_title LIKE :query OR tag_description like :query ", { query: "%#{params[:tag_line]}%" })
      if @tag.present?
        @tag.collect do |tag|
          unless tag.close_date.nil? && tag.open_date.nil?
            tag.close_date, tag.open_date = tag.close_date.utc, tag.open_date.utc; tag
          end
        end.reject!(&:blank?)
        #rating = find_rating(@tag)
        get_api_message "200","success"
        respond_to do |format|
          format.html { redirect_to @tag, notice: 'success.' }
          format.json { render json: {:response => {:status=>@message.status,:code=>@message.code, :message=>@message.custom_message, :open_tag_count => @tag.where("is_locked = ? AND close_date > ? " , true, DateTime.now.to_datetime.utc.to_s(:db)).count, :close_tag_count => @tag.where("close_date <= ? " , DateTime.now.to_datetime.utc.to_s(:db)).count, :open_tag_lines => @tag.where("is_locked = ? AND close_date > ? " , true, DateTime.now.to_datetime.utc.to_s(:db)).collect { |t| t.attributes.keep_if { |k, v| k != "user_id"  }.merge!( {:total_rating=> t.total_rating, :average_rating => t.average_rating }).merge!({ user: check_follower(t, current_user).user })   }, :close_tag_lines => @tag.where("close_date <= ? " , DateTime.now.to_datetime.utc.to_s(:db)).collect { |t| t.attributes.keep_if { |k, v| k != "user_id"  }.merge!( {:total_rating=> t.total_rating, :average_rating => t.average_rating }).merge!({ user: check_follower(t, current_user).user })   }   } } }