app/controllers/api/tags_controller.rb

  def get_all_taglines
    @user = User.find_by_authentication_token params[:auth_token]
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = '6tC5D3rJ4Ly1sFbw8onF' LIMIT 1

  def get_box_description
    @box_detail = Tag.find_by_id(params[:tag_id]) if params[:auth_token].present?
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` IS NULL LIMIT 1

  def box_time_line
    @user = User.find_by_authentication_token params[:auth_token]
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1

  def explore_tab
    #getting the page from request params and converting to integer if present
    @page = params[:page].to_i if params[:page]
    #getting the limit from request params and converting to integer if present
    @limit = params[:limit].to_i if params[:limit]
    #if page is not present in the request parameters then populating it with default value = 1
    @page ||= 1
    #if page value is specified and it is less than 1 then changing the value to 1
    @page = 1 if @page < 1
    #if limit is not specified then assigning the default limit value to 30
    @limit ||= 30
    # if limit is specified and is less than 1 then changing it to 1
    @limit = 1 if @limit < 1
    # caluclating the offset for pagination
    @offset = (@page - 1) * @limit
    #finding the user with the specified auth_token
    @user = User.find_by_authentication_token params[:auth_token]
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1

  def search_tagline_any_where
    if params[:auth_token].nil? && params[:tag_line].nil?
      get_api_message "501", "Invalid Request"
      respond_to do |format|
        format.html { redirect_to @tag, notice: 'Invalid request.' }
        format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message}} }
      end
    else
      current_user = User.find_by_authentication_token(params[:auth_token])
      @tag = Tag.where("tag_line like :query OR tag_title LIKE :query OR tag_description like :query", {query: "%#{params[:tag_line]}%"})
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `tags`.* FROM `tags` WHERE (tag_line like '%he%' OR tag_title LIKE '%he%' OR tag_description like '%he%') AND (close_date is not NULL AND close_date >= '2016-01-17 08:27:16')

  def boxes_and_drops_created_by_me
    @user = User.find_by_authentication_token(params[:auth_token])
    @user_id = params[:user_id]
    if params[:user_id].present?
      @boxes = User.find(params[:user_id]).try(:tags).where("close_date is not NULL")
      @drops = User.find(params[:user_id]).try(:ratings).where("is_anonymous_rating = ? AND is_box_locked = ?", false, false)
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`user_id` = 1 AND (close_date is not NULL)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 1 AND `user_ratings`.`rating_id` = 1 ORDER BY `user_ratings`.`id` DESC LIMIT 1

  def tagslines_by_user
    if params[:auth_token].present? && params[:user_id].present?
      current_user = User.find_by_authentication_token(params[:auth_token])
      @tag = Tag.where("is_post_to_wall = ? AND close_date is NOT NULL AND user_id = ?", true, params[:user_id])
      if @tag.present?
        @tag = check_followers(@tag, current_user)
        @tags = (@tag.collect { |t| t.attributes.keep_if { |k, v| !["user_id"].include?(k) }.merge!(average_rating: t.average_rating, total_rating: t.total_rating, user: t.user) }).sort! { |a, b| b["created_at"].to_datetime <=> a["created_at"].to_datetime }.first(30)
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`user_id` = 1 AND (close_date is not NULL)
SELECT COUNT(*) FROM `tags` WHERE (close_date is NOT NULL AND user_id = 1)

  def taglines_and_ratings_by_user
    if params[:auth_token].present? && params[:user_id].present? && params[:date].present?
      current_user = User.find_by_authentication_token(params[:auth_token])
      @rating = Rating.where("is_post_to_wall = ? AND user_id = ? AND is_anonymous_rating = ? AND created_at < ?", true, params[:user_id], false, params[:date]).order("created_at desc")
      @tag = Tag.where("is_post_to_wall = ? AND close_date is NOT NULL AND created_at < ? AND user_id = ?", true, params[:date], params[:user_id]).order("created_at desc")
      @tag = check_followers(@tag, current_user)
      @tags_and_ratings = tag_and_ratings @tag, @rating
      if @tags_and_ratings.present?
        egt_api_message "200", "success"
        respond_to do |format|
          format.html { redirect_to @tag, notice: 'tags was successfully sent.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :tags_and_ratings => @tags_and_ratings.sort! { |a, b| b["created_at"].to_datetime <=> a["created_at"].to_datetime }.first(30)}} }
        end
      else
        get_api_message "404", "no tag found"
        respond_to do |format|
          format.html { redirect_to @tag, notice: 'not found' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message}} }
        end
      end
    elsif params[:auth_token].present? && params[:date].present?
      current_user = User.find_by_authentication_token(params[:auth_token])
      @rating = Rating.where("user_id = ? AND created_at < ?", current_user.id, params[:date]).order("created_at desc")
      @tag = Tag.where("close_date is NOT NULL AND created_at < ? AND user_id = ?", params[:date], current_user.id).order("created_at desc")
      @tag = check_followers(@tag, current_user) if @tag.present?
      @tags_and_ratings = tag_and_ratings @tag, @rating
      if @tags_and_ratings.present?
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`user_id` = 1 ORDER BY created_at desc
SELECT `tags`.* FROM `tags` WHERE (close_date is NOT NULL AND user_id = 1) ORDER BY created_at desc
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`tag_id` = 4
SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 200 LIMIT 1

  def ratings_by_user
    if params[:auth_token].present? && params[:user_id] && params[:date].present?
      current_user = User.find_by_authentication_token(params[:auth_token])
      @rating = Rating.where("is_post_to_wall = ? AND user_id = ? AND is_anonymous_rating = ? AND created_at < ?", true, params[:user_id], false, params[:date]).order("created_at desc")
      if @rating.present?
        @rating = @rating.collect { |t| t.attributes.keep_if { |k, v| !["tag_id", "user_id"].include?(k) }.merge!(tag_line: Tag.find_by_id(t.tag_id).attributes.keep_if { |k, v| !["user_id"].include?(k) }.merge!({average_rating: Tag.find_by_id(t.tag_id).average_rating, total_rating: Tag.find_by_id(t.tag_id).total_rating, user: check_user(Tag.find_by_id(t.tag_id).user, current_user)}), comments: t.comments.count, user: t.user, is_like: (UserRating.where(user_id: current_user.id, rating_id: t.id).try(:last).try(:is_like) || false)) }.sort! { |a, b| b["created_at"].to_datetime <=> a["created_at"].to_datetime }.first(30)
        get_api_message "200", "success"
        respond_to do |format|
          format.html { redirect_to @tag, notice: 'tags was successfully sent.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :ratings => @rating}} }
        end
      else
        get_api_message "404", "no tag found"
        respond_to do |format|
          format.html { redirect_to @tag, notice: 'not found' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message}} }
        end
      end
    elsif params[:auth_token].present? && params[:date].present?
      current_user = User.find_by_authentication_token(params[:auth_token])
      @rating = Rating.where("is_post_to_wall = ? AND user_id = ? AND is_anonymous_rating = ? AND created_at < ?", true, current_user, false, params[:date]).order("created_at desc")
      if @rating.present?
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 1 AND `user_ratings`.`rating_id` = 1 ORDER BY `user_ratings`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `ratings` WHERE (user_id = 1)
SELECT `comments`.* FROM `comments` WHERE `comments`.`rating_id` = 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def find_rating(tag)
    total_rating = 0
    #total_count = 0
    #rating = 0
    average_rating = 0
    tag.each do |t|
      total_rating = Tag.find(t).ratings.collect(&:rating).count
      a_rating = Tag.find(t).ratings.collect(&:rating).sum
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`tag_id` = 1 AND (user_id != 1 AND user_id NOT IN(NULL))
SELECT COUNT(*) FROM `tags` WHERE (tag_line like '%he%' OR tag_title LIKE '%he%' OR tag_description like '%he%') AND (close_date is not NULL AND close_date >= '2016-01-17 08:28:55')
SELECT `ratings`.* FROM `ratings` WHERE (user_id IN (1,2) AND is_anonymous_rating = 0)
SELECT `tags`.* FROM `tags` WHERE (close_date is not NULL AND close_date >= '2016-01-14 18:37:13')