app/controllers/api/users_controller.rb

  def facebook_login
    if params[:request][:user][:facebook_user_id].present?
      @user = User.find_by_facebook_user_id(params[:request][:user][:facebook_user_id]) #User.find_by_email(params[:request][:user][:email]) &&
      if @user.nil?
        if params[:request][:user][:email].present?
          @user = User.find_by_email(params[:request][:user][:email])
          if @user.present?
            @user.update_attributes(facebook_user_id: params[:request][:user][:facebook_user_id], device_token: params[:request][:user][:device_token])
            get_api_message "200", "Successful login."
            respond_to do |format|
              format.html { redirect_to @user, notice: 'user was successfully created.' }
              format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})}} }
            end
          else
            user = User.find_by_user_name(params[:request][:user][:user_name])
            user.present? ? (@user=User.new params[:request][:user].except(:user_name).merge!({skip_password_form: true, user_name: "#{params[:request][:user][:user_name]}#{rand(10)}"})) : (@user = User.new params[:request][:user].merge!({skip_password_form: true}))
            if @user.save
              get_api_message "200", "Created"
              respond_to do |format|
                format.html { redirect_to @user, notice: 'user was successfully created.' }
                format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})}} }
              end
            else
              if !@user.errors.empty?
---
SELECT 1 AS one FROM `users` WHERE (`users`.`facebook_user_id` = BINARY 'oooo999iixuucycyyc' AND `users`.`id` != 10) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`facebook_user_id` = 'oooo999iixuucycyyc' LIMIT 1
SELECT 1 AS one FROM `users` WHERE (`users`.`email` = BINARY 'aa@gmail.com' AND `users`.`id` != 10) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'aa@gmail.com' LIMIT 1
UPDATE `users` SET `facebook_user_id` = 'ooodbbbddo999iixdddduucycyyc', `updated_at` = '2015-12-12 12:11:12' WHERE `users`.`id` = 24
SELECT `users`.* FROM `users` WHERE `users`.`user_name` = 'admin@example.com' LIMIT 1
SELECT 1 AS one FROM `users` WHERE (`users`.`user_name` = 'aaa' AND `users`.`id` != 10) LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 501 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'uc3fem7T3PHZ9KNyCxvs' LIMIT 1
INSERT INTO `users` (`about_me`, `authentication_token`, `badge_count`, `blank_password`, `confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `device_token`, `email`, `encrypted_password`, `facebook_user_id`, `full_name`, `gender`, `is_email_confirmed`, `is_follower`, `is_following`, `is_password_blank`, `is_public_profile`, `last_sign_in_at`, `last_sign_in_ip`, `location`, `merged_account`, `phone`, `photo`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `reveal_id`, `sign_in_count`, `twitter_user_id`, `unconfirmed_email`, `updated_at`, `user_name`) VALUES (NULL, 'uc3fem7T3PHZ9KNyCxvs', 0, NULL, '2015-12-12 11:19:32', 'spb3kg4HeqVFuUxwUEqs', NULL, '2015-12-12 11:19:32', NULL, NULL, 'iphone6', 'aa@gmail.com', '', 'oooo999iixuucycyyc', 'abcxxx', NULL, 0, 0, 0, 0, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, '2015-12-12 11:19:32', 'aaa')
SELECT COUNT(*) FROM `user_follows` WHERE `user_follows`.`follow_id` = 10 AND `user_follows`.`is_approved` = 1

  def twitter_login
    @user = User.find_by_twitter_user_id(params[:request][:user][:twitter_user_id])
    if @user.present?
      if @user.is_password_blank == true
        #@user.update_attribute(:about_me, params[:request][:user][:about_me]) if params[:request][:user][:twitter_user_id].present?
        @user.update_attribute(:gender, params[:request][:user][:gender]) if params[:request][:user][:gender].present?
        get_api_message "200", "auth_token sent"
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Sent authentication token.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})}} }
        end
      elsif @user.is_password_blank == false
        get_api_message "200", "Please complete your profile first."
        #@user.update_attribute(:about_me, params[:request][:user][:about_me]) if params[:request][:user][:twitter_user_id].present?
        @user.update_attribute(:gender, params[:request][:user][:gender]) if params[:request][:user][:gender].present?
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Complete your profile.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})}} }
        end
      else
        get_api_message "501", "Invalid request"
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Invalid request.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, :user => @user}} }
        end
      end
    else
      user = User.find_by_user_name(params[:request][:user][:user_name])
      user.present? ? ((twitter_user_name = "#{params[:request][:user][:user_name]}#{rand(10)}") && twitter_user_creation(twitter_user_name)) : twitter_user_creation(params[:request][:user][:user_name])
---
SELECT `users`.* FROM `users` WHERE `users`.`twitter_user_id` = '1234rtty7' LIMIT 1
SELECT 1 AS one FROM `users` WHERE (`users`.`twitter_user_id` = BINARY '1234rtty7' AND `users`.`id` != 2) LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 404 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'qckMfKG3uF2zaTpinEBA' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`user_name` = 'hello' LIMIT 1
SELECT 1 AS one FROM `users` WHERE (`users`.`user_name` = 'hello' AND `users`.`id` != 2) LIMIT 1

  def search_user
    if params[:auth_token] && params[:user_name]
      current_user = User.find_by_authentication_token params[:auth_token]
      if params[:user_name].include? "@"
        @user = User.where("user_name like ?", "%#{params[:user_name].split('@')[1]}%")
      else
        @user = User.where("user_name like ? OR full_name like ?", "%#{params[:user_name]}%", "%#{params[:user_name]}%")
      end
      if @user
        get_api_message "200", "User found"
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Found user successfully.' }
          format.json { render json: {:response => {:status => @message.status, :code => @message.code, :message => @message.custom_message, users: @user.each { |user| check_user(user, current_user).hide_fields }}} }
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'AXZsb3JYS56XuzKgsbux' LIMIT 1
SELECT `users`.* FROM `users` WHERE (user_name like '%abcxxx%' OR full_name like '%abcxxx%')
SELECT `messages`.* FROM `messages` WHERE `messages`.`code` = 200 LIMIT 1

  def twitter_or_facebook_users
    #debugger
    @user = User.find_by_authentication_token params[:auth_token]

    ids = params[:request][:ids].map(&:to_s)

    tellum_followers_ids   = @user.user_follows.pluck(:follow_id)

    if params[:request][:facebook_ids].present?
      facebook_followers_ids = User.where( :facebook_user_id => ids).pluck(:id)
      final_ids = facebook_followers_ids - tellum_followers_ids
      @users = User.where(:id => final_ids)
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `users`.* FROM `users` WHERE (facebook_user_id IN ('oooo999iixuucycyyc','ooodbbbddo999iixdddduucycyyc','ooodbbbddo9nn99iixdddduucycyyc'))