app/controllers/api/user_follows_controller.rb

  def follow_users
    request_sent = Array.new
    current_user = User.find_by_authentication_token(params[:auth_token])
    users = params[:request][:user_id].map { |k, v| k[:user_id] }
    users.each do |user|
      @user = UserFollow.where(user_id: user, follow_id: current_user.id)
      if !@user.present?
        @user_follow = UserFollow.new(user_id: user, follow_id: current_user.id)
        if User.find_by_id(user).is_public_profile == true
          @user_follow.save
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rTBnYufApbg1HSqexu3S' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `user_follows` (`created_at`, `follow_id`, `is_accepted`, `is_approved`, `updated_at`, `user_id`) VALUES ('2016-01-30 14:15:58', 1, NULL, 1, '2016-01-30 14:15:58', 3)