app/controllers/api/users_controller.rb

INSERT INTO `users` (`about_me`, `authentication_token`, `badge_count`, `blank_password`, `confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `device_token`, `email`, `encrypted_password`, `facebook_user_id`, `full_name`, `gender`, `is_email_confirmed`, `is_follower`, `is_following`, `is_password_blank`, `is_public_profile`, `last_sign_in_at`, `last_sign_in_ip`, `location`, `merged_account`, `phone`, `photo`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `reveal_id`, `sign_in_count`, `twitter_user_id`, `unconfirmed_email`, `updated_at`, `user_name`) VALUES (NULL, 'qckMfKG3uF2zaTpinEBA', 0, NULL, '2015-12-10 17:57:30', '1xx9Vkns9gFpPvQ3Cxxx', NULL, '2015-12-10 17:57:30', NULL, NULL, 'iphone 6s', '', '', NULL, 'hey', NULL, 0, 0, 0, 0, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, '1234rtty7', NULL, '2015-12-10 17:57:30', 'hello')
---
  def twitter_login
    @user = User.find_by_twitter_user_id(params[:request][:user][:twitter_user_id]) || User.find_by_user_name(params[:request][:user][:user_name])
    if @user.present?
      if @user.is_password_blank == true
        @user.update_attributes(twitter_user_id: params[:request][:user][:twitter_user_id]) if params[:request][:user][:twitter_user_id].present?
        get_api_message "200","auth_token sent"
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Sent authentication token.' }
          format.json { render json: {:response => {:status=>@message.status,:code=>@message.code,:message=>@message.custom_message,  :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})} } }
        end
      elsif @user.is_password_blank == false
        get_api_message "200","Please complete your profile first."
        @user.update_attributes(twitter_user_id: params[:request][:user][:twitter_user_id]) if params[:request][:user][:twitter_user_id].present?
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Complete your profile.' }
          format.json { render json: {:response => {:status=>@message.status,:code=>@message.code,:message=>@message.custom_message,  :user => @user.hide_fields.merge!({:authentication_token => @user.authentication_token, followers_count: UserFollow.where(user_id: @user.id, is_approved: true).count, followings_count: UserFollow.where(follow_id: @user.id, is_approved: true).count})} } }
        end
      else
        get_api_message "501","Invalid request"
        respond_to do |format|
          format.html { redirect_to @user, notice: 'Invalid request.' }
          format.json { render json: {:response => {:status=>@message.status,:code=>@message.code,:message=>@message.custom_message, :user => @user }  }}
        end
      end
    else
      @user = User.new(params[:request][:user].merge!({skip_password_form: true}))
      if @user.save