app/views/api/notifications/all_notifications.json.jbuilder

      json.message "Successfully Fetched relevant notifications..."
      json.notifications @notifications.each do |noti|
          sender_pic = User.find_by_id(noti.sender_id).try(:photo).try(:url)
---
SELECT `notifications`.* FROM `notifications` WHERE (user_id = 1 AND is_deleted = 0) ORDER BY created_at desc
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

            json.is_anonymous_rating drop.try(:is_anonymous_rating)
            json.is_like ( UserRating.where(user_id: @user.id, rating_id: drop.try(:id)).try(:last).try(:is_like) || false )
---
SELECT `user_ratings`.* FROM `user_ratings` WHERE `user_ratings`.`user_id` = 1 AND `user_ratings`.`rating_id` = 1 ORDER BY `user_ratings`.`id` DESC LIMIT 1