app/views/api/notifications/update.json.jbuilder

UPDATE `notifications` SET `is_seen` = 1, `updated_at` = '2016-01-18 16:48:19' WHERE `notifications`.`id` = 6
---
  if @notification.present?
    @notification.update_attribute :is_seen, true